pvvx/esp8266web/app/driver/rs485drv.c
		rs485_rx_clr_buf(); // отключим loopback и сбросим rx fifo, ошибки приема и буфер
		// enable rx time-out function
		// Установить TOUT 8*x тактов для определения паузы конца сообщения
		//UART0_CONF1_TOUT(rs485vars.tout_thrhd); // 3.5*11 = 28 тиков, 28/8 = 3.5 символа, TOUT=3 -> 16..24 тика
		rs485vars.flg.ui = 0;
		UART0_INT_CLR = ~0;
		UART0_INT_ENA = UART_RXFIFO_FULL_INT_ENA | UART_RXFIFO_TOUT_INT_ENA; // | UART_RX_ERR_INTS;
		rs485vars.status = RS485_RX_ENA;
		// запустить таймер предельного времени ожидания приема/отправки пакета
//		ets_timer_disarm(&rs485vars.timerw); // остановить таймер предельного времени ожидания приема пакета // вызовет в ets_timer_arm_new()
		ets_timer_arm_new(&rs485vars.timerw, rs485cfg.timeout, 0, 1); // запустить таймер предельного времени ожидания приема пакета
		start_full_timerp(); // Зарядить таймер определения паузы на 3.5 символа или на 1750 us при baud > 19200
	}
//	ets_intr_unlock();
}
/* *************************************
 * Очистить все очереди сообщений RS485
 * Запуск при остановленном драйвере!
 ************************************* */
void ICACHE_FLASH_ATTR rs485_drv_clr_bufs(void)
{
	struct srs485msg *msg;
#ifdef	RS485_DRV_USE_RX_LIST
	SLIST_FOREACH(msg, &rs485vars.rxmsgs, next) os_free(msg);
	SLIST_INIT(&rs485vars.rxmsgs);
#endif
	rs485vars.curtxmsg = NULL;
	SLIST_FOREACH(msg, &rs485vars.txmsgs, next) os_free(msg);
	SLIST_INIT(&rs485vars.txmsgs);
}
/* *******************************
 * Остановить драйвер RS485
 ******************************** */
void ICACHE_FLASH_ATTR rs485_drv_stop(void)
{
	UART0_INT_ENA = 0;

	uint32 conf0 = UART0_CONF0 & (~ (UART_RXFIFO_RST | UART_TXFIFO_RST | UART_LOOPBACK));
	UART0_CONF0 = conf0 | UART_RXFIFO_RST | UART_TXFIFO_RST;
	UART0_CONF0 = conf0;

	ets_timer_disarm(&rs485vars.timerp);
	ets_timer_disarm(&rs485vars.timerw);
	// tx как i/o порт ввода
	if(rs485cfg.flg.b.swap != 0)	MUX_TX15_UART0 = VAL_MUX_TX15_UART0_OFF;
	else MUX_TX1_UART0 = VAL_MUX_TX1_UART0_OFF;
	// переключение шины/драйвера на режим rx
	rs485_rx_enable();
	UART0_INT_CLR = ~0;
	rs485vars.status = RS485_TX_RX_OFF;
	rs485_drv_clr_bufs();
}
/* **********************************************
 * (Ре)Инициализация драйвера RS-485 по скорости
 ********************************************** */
void ICACHE_FLASH_ATTR rs485_drv_set_baud(void)
{
	if(rs485cfg.baud > RS485_MAX_BAUD) rs485cfg.baud = RS485_MAX_BAUD;
	else if(rs485cfg.baud < RS485_MIN_BAUD) rs485cfg.baud = RS485_MIN_BAUD;
	ets_intr_lock();
	uint32 x = (ets_get_cpu_frequency()  * 1000000) >> (CLK_PRE_PORT & 1);
	UART0_CLKDIV = x / rs485cfg.baud;
	rs485cfg.baud = x / UART0_CLKDIV;
	uint32 tout_thrhd;
	if((rs485cfg.flg.b.spdtw == 0) && rs485cfg.baud > 19203) {
		tout_thrhd = (750 * rs485cfg.baud + 4000000)/8000000;
		if(tout_thrhd > 125) tout_thrhd = 125;
		rs485vars.waitust = 1750 - (tout_thrhd*8000000)/rs485cfg.baud;
		tout_thrhd += 2;
	}
	else {
		tout_thrhd = 4; // 24..32 bits
		rs485vars.waitust = ((39-((4-1)*8))*1000000)/rs485cfg.baud; // in us // (Pause(bits) - (tout-1)*8) * 1000000(us in sec)/baud
	}
	rs485vars.waitust += rs485cfg.pause; // добавка времени в us между сообщениями, 1…65535 мкс, 0 - не используется
	UART0_CONF0 = 0x1C | (rs485cfg.flg.b.parity & 3) | ((rs485cfg.flg.b.parity & UART_PARITY_EN)? 0 : (2-(rs485cfg.flg.b.parity&1)) << UART_STOP_BIT_NUM_S);
    UART0_CONF1_TOUT(tout_thrhd);
	ets_intr_unlock();
}
/* ********************************************
 * (Ре)Инициализация драйвера RS-485 по пинам
 ******************************************** */
void ICACHE_FLASH_ATTR rs485_drv_set_pins(void)
{
	uint32 pin_ena = rs485cfg.flg.b.pin_ena;
	uint32 x = (rs485cfg.flg.b.swap)? 0x503F : 0xF035; // биты пинов
	if(pin_ena < 16 && ((x & (1 << pin_ena)) == 0)) pin_ena = -1;
	uint32 pin_tx = 1;
	PERI_IO_SWAP &= ~(PERI_IO_UART_PORT_SWAP | PERI_IO_UART0_PIN_SWAP);
	if(rs485cfg.flg.b.swap != 0) {
		pin_tx = 15;
		PERI_IO_SWAP |= PERI_IO_UART0_PIN_SWAP; // swap uart0 pins (u0rxd <-> u0cts), (u0txd <-> u0rts)
		MUX_RX13_UART0 = VAL_MUX_RX13_UART0_ON; // настроить пин RX
	}
	else {
		MUX_RX3_UART0 = VAL_MUX_RX3_UART0_ON; // настроить пин RX
	}
	// pin TX при приеме
	GPIO_PIN(pin_tx) = GPIO_PIN_DRIVER;
	GPIO_OUT_W1TS = 1 << pin_tx;
	GPIO_ENABLE_W1TC = 1 << pin_tx;
	// pin OE_TX in I/O
	if(pin_ena < 16) {
		rs485vars.pin_ena_mask = 1 << pin_ena;
		rs485_rx_enable();
		GPIO_ENABLE_W1TS = rs485vars.pin_ena_mask;
		set_gpiox_mux_func_ioport(pin_ena); //	SET_PIN_FUNC_IOPORT(pin_ena);
	}
	else rs485vars.pin_ena_mask = 0;
}
/* *****************************
 * Инициализация драйвера rs485
 ******************************** */
void ICACHE_FLASH_ATTR rs485_drv_init(void)
{
	UART0_INT_ENA = 0;

	rs485_drv_set_pins();
    rs485_drv_set_baud();

    rs485_rx_clr_buf();
	UART0_INT_CLR = ~0;

	system_os_task(rs485_task, RS485_TASK_PRIO, rs485vars.taskQueue, RS485_TASK_QUEUE_LEN);

	ets_isr_attach(ETS_UART_INUM, rs485_uart_isr, NULL);
	ets_isr_unmask(1 << ETS_UART_INUM);

	rs485vars.status = RS485_TX_RX_OFF;
	rs485vars.pbufi = bufi;

#ifdef	RS485_DRV_USE_RX_LIST
	SLIST_INIT(&rs485vars.rxmsgs);
#endif
	SLIST_INIT(&rs485vars.txmsgs);

	ets_timer_disarm(&rs485vars.timerp);
	ets_timer_setfn(&rs485vars.timerp, (os_timer_func_t *)rs485_timerp_isr, NULL);
	ets_timer_disarm(&rs485vars.timerw);
	ets_timer_setfn(&rs485vars.timerw, (os_timer_func_t *)rs485_timerw_isr, NULL);
}

#endif // USE_RS485DRV
